คณะครุศาสตร์
หลักสูตรศึกษาศาสตรบัณฑิต = การศึกษาปฐมวัย
หลักสูตรศึกษาศาสตรบัณฑิต = การประถมศึกษา


คณะวิทยาศาสตร์และเทคโนโลยี
หลักสูตรวิทยาศาสตรบัณฑิต = เทคโนโลยีสารสนเทศ
หลักสูตรวิทยาศาสตรบัณฑิต = สิ่งแวดล้อมเมืองและอุตสาหกรรม
หลักสูตรวิทยาศาสตรบัณฑิต = วิทยาศาสตร์เครื่องสำอาง
หลักสูตรวิทยาศาสตรบัณฑิต = อาชีวอนามัยและความปลอดภัย
หลักสูตรวิทยาศาสตรบัณฑิต = เทคโนโลยีเคมี
หลักสูตรวิทยาศาสตรบัณฑิต = วิทยาการคอมพิวเตอร์
หลักสูตรศึกษาศาสตรบัณฑิต = คณิตศาสตร์
หลักสูตรศึกษาศาสตรบัณฑิต = ฟิสิกส์
หลักสูตรวิทยาศาสตรบัณฑิต = ความมั่นคงปลอดภัยไซเบอร์


คณะวิทยาการจัดการ
หลักสูตรบัญชีบัณฑิต = การบัญชี
หลักสูตรบริหารธุรกิจบัณฑิต = การเงิน
หลักสูตรบริหารธุรกิจบัณฑิต = การตลาด
หลักสูตรการจัดการบัณฑิต = การจัดการ
หลักสูตรบริหารธุรกิจบัณฑิต = การบริการลูกค้า
หลักสูตรบริหารธุรกิจบัณฑิต = การจัดการธุรกิจค้าปลีก
หลักสูตรบริหารธุรกิจบัณฑิต = การจัดการทรัพยากรมนุษย์
หลักสูตรบริหารธุรกิจบัณฑิต = คอมพิวเตอร์ธุรกิจ
หลักสูตรบริหารธุรกิจบัณฑิต = ธุรกิจระหว่างประเทศ
หลักสูตรนิเทศศาสตรบัณฑิต = นิเทศศาสตร์
หลักสูตรบริหารธุรกิจบัณฑิต = เลขานุการทางการแพทย์

คณะมนุษยศาสตร์และสังคมศาสตร์
หลักสูตรศิลปศาสตรบัณฑิต = ภาษาอังกฤษธุรกิจ
หลักสูตรศิลปศาสตรบัณฑิต = จิตวิทยาอุตสาหกรรมและองค์การ
หลักสูตรศิลปศาสตรบัณฑิต = ภาษาไทย
หลักสูตรศิลปศาสตรบัณฑิต = ภาษาอังกฤษ
หลักสูตรศิลปศาสตรบัณฑิต = ภาษาจีน
หลักสูตรศึกษาศาสตรบัณฑิต = ศิลปศึกษา
หลักสูตรศิลปศาสตรบัณฑิต = บรรณารักษศาสตร์และสารสนเทศศาสตร์
หลักสูตรนิติศาสตรบัณฑิต= นิติศาสตร์


คณะพยาบาลศาสตร์
หลักสูตรพยาบาลศาสตรบัณฑิต = พยาบาลศาสตร์


โรงเรียนการท่องเที่ยวและการบริการ
หลักสูตรศิลปศาสตรบัณฑิต = การท่องเที่ยว
หลักสูตรศิลปศาสตรบัณฑิต = ธุรกิจการโรงแรม
หลักสูตรศิลปศาสตรบัณฑิต = ธุรกิจการบิน
หลักสูตรศิลปศาสตรบัณฑิต = ออกแบบนิทรรศการและการจัดแสดง
หลักสูตรศิลปศาสตรบัณฑิต = การจัดการงานบริการ (หลักสูตรนานาชาติ)


โรงเรียนการเรือน
หลักสูตรวิทยาศาสตรบัณฑิต = เทคโนโลยีการแปรรูปอาหาร
หลักสูตรวิทยาศาสตรบัณฑิต = เทคโนโลยีการประกอบอาหารและบริการ
หลักสูตรศิลปศาสตรบัณฑิต = คหกรรมศาสตร์
หลักสูตรวิทยาศาสตรบัณฑิต = โภชนการและการประกอบอาหาร