const facultyMajorsPrograms = {
  "คณะครุศาสตร์": {
    "การศึกษาปฐมวัย": "หลักสูตรศึกษาศาสตรบัณฑิต",
    "การประถมศึกษา": "หลักสูตรศึกษาศาสตรบัณฑิต"
  },
  "คณะวิทยาศาสตร์และเทคโนโลยี": {
    "เทคโนโลยีสารสนเทศ": "หลักสูตรวิทยาศาสตรบัณฑิต",
    "สิ่งแวดล้อมเมืองและอุตสาหกรรม": "หลักสูตรวิทยาศาสตรบัณฑิต",
    "วิทยาศาสตร์เครื่องสำอาง": "หลักสูตรวิทยาศาสตรบัณฑิต",
    "อาชีวอนามัยและความปลอดภัย": "หลักสูตรวิทยาศาสตรบัณฑิต",
    "เทคโนโลยีเคมี": "หลักสูตรวิทยาศาสตรบัณฑิต",
    "วิทยาการคอมพิวเตอร์": "หลักสูตรวิทยาศาสตรบัณฑิต",
    "คณิตศาสตร์": "หลักสูตรศึกษาศาสตรบัณฑิต",
    "ฟิสิกส์": "หลักสูตรศึกษาศาสตรบัณฑิต",
    "ความมั่นคงปลอดภัยไซเบอร์": "หลักสูตรวิทยาศาสตรบัณฑิต"
  },
  "คณะวิทยาการจัดการ": {
    "การบัญชี": "หลักสูตรบัญชีบัณฑิต",
    "การเงิน": "หลักสูตรบริหารธุรกิจบัณฑิต",
    "การตลาด": "หลักสูตรบริหารธุรกิจบัณฑิต",
    "การจัดการ": "หลักสูตรการจัดการบัณฑิต",
    "การบริการลูกค้า": "หลักสูตรบริหารธุรกิจบัณฑิต",
    "การจัดการธุรกิจค้าปลีก": "หลักสูตรบริหารธุรกิจบัณฑิต",
    "การจัดการทรัพยากรมนุษย์": "หลักสูตรบริหารธุรกิจบัณฑิต",
    "คอมพิวเตอร์ธุรกิจ": "หลักสูตรบริหารธุรกิจบัณฑิต",
    "ธุรกิจระหว่างประเทศ": "หลักสูตรบริหารธุรกิจบัณฑิต",
    "นิเทศศาสตร์": "หลักสูตรนิเทศศาสตรบัณฑิต",
    "เลขานุการทางการแพทย์": "หลักสูตรบริหารธุรกิจบัณฑิต"
  },
  "คณะมนุษยศาสตร์และสังคมศาสตร์": {
    "ภาษาอังกฤษธุรกิจ": "หลักสูตรศิลปศาสตรบัณฑิต",
    "จิตวิทยาอุตสาหกรรมและองค์การ": "หลักสูตรศิลปศาสตรบัณฑิต",
    "ภาษาไทย": "หลักสูตรศิลปศาสตรบัณฑิต",
    "ภาษาอังกฤษ": "หลักสูตรศิลปศาสตรบัณฑิต",
    "ภาษาจีน": "หลักสูตรศิลปศาสตรบัณฑิต",
    "ศิลปศึกษา": "หลักสูตรศึกษาศาสตรบัณฑิต",
    "บรรณารักษศาสตร์และสารสนเทศศาสตร์": "หลักสูตรศิลปศาสตรบัณฑิต",
    "นิติศาสตร์": "หลักสูตรนิติศาสตรบัณฑิต"
  },
  "คณะพยาบาลศาสตร์": {
    "พยาบาลศาสตร์": "หลักสูตรพยาบาลศาสตรบัณฑิต"
  },
  "โรงเรียนการท่องเที่ยวและการบริการ": {
    "การท่องเที่ยว": "หลักสูตรศิลปศาสตรบัณฑิต",
    "ธุรกิจการโรงแรม": "หลักสูตรศิลปศาสตรบัณฑิต",
    "ธุรกิจการบิน": "หลักสูตรศิลปศาสตรบัณฑิต",
    "ออกแบบนิทรรศการและการแสดง": "หลักสูตรศิลปศาสตรบัณฑิต",
    "การจัดการงานบริการ (นานาชาติ)": "หลักสูตรศิลปศาสตรบัณฑิต"
  },
  "โรงเรียนการเรือน": {
    "เทคโนโลยีการแปรรูปอาหาร": "หลักสูตรวิทยาศาสตรบัณฑิต",
    "เทคโนโลยีการประกอบอาหารและบริการ": "หลักสูตรวิทยาศาสตรบัณฑิต",
    "คหกรรมศาสตร์": "หลักสูตรศิลปศาสตรบัณฑิต",
    "โภชนการและการประกอบอาหาร": "หลักสูตรวิทยาศาสตรบัณฑิต"
  }
};

test = [
  [
    "คณะครุศาสตร์",
    {
      "การศึกษาปฐมวัย": "หลักสูตรศึกษาศาสตรบัณฑิต",
      "การประถมศึกษา": "หลักสูตรศึกษาศาสตรบัณฑิต"
    }
  ],
  [
    "คณะวิทยาศาสตร์และเทคโนโลยี",
    {
      "เทคโนโลยีสารสนเทศ": "หลักสูตรวิทยาศาสตรบัณฑิต",
      "สิ่งแวดล้อมเมืองและอุตสาหกรรม": "หลักสูตรวิทยาศาสตรบัณฑิต",
      "วิทยาศาสตร์เครื่องสำอาง": "หลักสูตรวิทยาศาสตรบัณฑิต",
      "อาชีวอนามัยและความปลอดภัย": "หลักสูตรวิทยาศาสตรบัณฑิต",
      "เทคโนโลยีเคมี": "หลักสูตรวิทยาศาสตรบัณฑิต",
      "วิทยาการคอมพิวเตอร์": "หลักสูตรวิทยาศาสตรบัณฑิต",
      "คณิตศาสตร์": "หลักสูตรศึกษาศาสตรบัณฑิต",
      "ฟิสิกส์": "หลักสูตรศึกษาศาสตรบัณฑิต",
      "ความมั่นคงปลอดภัยไซเบอร์": "หลักสูตรวิทยาศาสตรบัณฑิต"
    }
  ],
  [
    "คณะวิทยาการจัดการ",
    {
      "การบัญชี": "หลักสูตรบัญชีบัณฑิต",
      "การเงิน": "หลักสูตรบริหารธุรกิจบัณฑิต",
      "การตลาด": "หลักสูตรบริหารธุรกิจบัณฑิต",
      "การจัดการ": "หลักสูตรการจัดการบัณฑิต",
      "การบริการลูกค้า": "หลักสูตรบริหารธุรกิจบัณฑิต",
      "การจัดการธุรกิจค้าปลีก": "หลักสูตรบริหารธุรกิจบัณฑิต",
      "การจัดการทรัพยากรมนุษย์": "หลักสูตรบริหารธุรกิจบัณฑิต",
      "คอมพิวเตอร์ธุรกิจ": "หลักสูตรบริหารธุรกิจบัณฑิต",
      "ธุรกิจระหว่างประเทศ": "หลักสูตรบริหารธุรกิจบัณฑิต",
      "นิเทศศาสตร์": "หลักสูตรนิเทศศาสตรบัณฑิต",
      "เลขานุการทางการแพทย์": "หลักสูตรบริหารธุรกิจบัณฑิต"
    }
  ],
  [
    "คณะมนุษยศาสตร์และสังคมศาสตร์",
    {
      "ภาษาอังกฤษธุรกิจ": "หลักสูตรศิลปศาสตรบัณฑิต",
      "จิตวิทยาอุตสาหกรรมและองค์การ": "หลักสูตรศิลปศาสตรบัณฑิต",
      "ภาษาไทย": "หลักสูตรศิลปศาสตรบัณฑิต",
      "ภาษาอังกฤษ": "หลักสูตรศิลปศาสตรบัณฑิต",
      "ภาษาจีน": "หลักสูตรศิลปศาสตรบัณฑิต",
      "ศิลปศึกษา": "หลักสูตรศึกษาศาสตรบัณฑิต",
      "บรรณารักษศาสตร์และสารสนเทศศาสตร์": "หลักสูตรศิลปศาสตรบัณฑิต",
      "นิติศาสตร์": "หลักสูตรนิติศาสตรบัณฑิต"
    }
  ],
  [
    "คณะพยาบาลศาสตร์",
    {
      "พยาบาลศาสตร์": "หลักสูตรพยาบาลศาสตรบัณฑิต"
    }
  ],
  [
    "โรงเรียนการท่องเที่ยวและการบริการ",
    {
      "การท่องเที่ยว": "หลักสูตรศิลปศาสตรบัณฑิต",
      "ธุรกิจการโรงแรม": "หลักสูตรศิลปศาสตรบัณฑิต",
      "ธุรกิจการบิน": "หลักสูตรศิลปศาสตรบัณฑิต",
      "ออกแบบนิทรรศการและการแสดง": "หลักสูตรศิลปศาสตรบัณฑิต",
      "การจัดการงานบริการ (นานาชาติ)": "หลักสูตรศิลปศาสตรบัณฑิต"
    }
  ],
  [
    "โรงเรียนการเรือน",
    {
      "เทคโนโลยีการแปรรูปอาหาร": "หลักสูตรวิทยาศาสตรบัณฑิต",
      "เทคโนโลยีการประกอบอาหารและบริการ": "หลักสูตรวิทยาศาสตรบัณฑิต",
      "คหกรรมศาสตร์": "หลักสูตรศิลปศาสตรบัณฑิต",
      "โภชนการและการประกอบอาหาร": "หลักสูตรวิทยาศาสตรบัณฑิต"
    }
  ]
]